bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/audio_reg_struct.h
typedef volatile union {
	struct {
		uint32_t anc_if_sft_r_0           :  3; /**<bit[0 : 2] */
		uint32_t reserved_bit_3_3         :  1; /**<bit[3 : 3] */
		uint32_t anc_if_sft_r_1           :  3; /**<bit[4 : 6] */
		uint32_t reserved_bit_7_7         :  1; /**<bit[7 : 7] */
		uint32_t anc_if_sft_r_2           :  3; /**<bit[8 : 10] */
		uint32_t reserved_bit_11_11       :  1; /**<bit[11 : 11] */
		uint32_t anc_if_sft_r_3           :  3; /**<bit[12 : 14] */
		uint32_t reserved_bit_15_15       :  1; /**<bit[15 : 15] */
		uint32_t anc_if_sft_r_4           :  3; /**<bit[16 : 18] */
		uint32_t reserved_bit_19_19       :  1; /**<bit[19 : 19] */
		uint32_t anc_if_sft_r_5           :  3; /**<bit[20 : 22] */
		uint32_t reserved_bit_23_31       :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} audio_reg_anc_sft_r_para_t;


typedef volatile union {
	struct {
		uint32_t k_val_0                  : 16; /**<bit[0 : 15] */
		uint32_t reserved_bit_16_31       : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} audio_reg_k_val_0_t;


typedef volatile union {
	struct {
		uint32_t k_val_1                  : 16; /**<bit[0 : 15] */
		uint32_t reserved_bit_16_31       : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} audio_reg_k_val_1_t;


typedef volatile union {
	struct {
		uint32_t k_val_2                  : 16; /**<bit[0 : 15] */
		uint32_t reserved_bit_16_31       : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} audio_reg_k_val_2_t;


typedef volatile union {
	struct {
		uint32_t k_val_3                  : 16; /**<bit[0 : 15] */
		uint32_t reserved_bit_16_31       : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} audio_reg_k_val_3_t;


typedef volatile union {
	struct {
		uint32_t k_val_4                  : 16; /**<bit[0 : 15] */
		uint32_t reserved_bit_16_31       : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} audio_reg_k_val_4_t;


typedef volatile union {
	struct {
		uint32_t k_val_5                  : 16; /**<bit[0 : 15] */
		uint32_t reserved_bit_16_31       : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} audio_reg_k_val_5_t;


typedef volatile union {
	struct {
		uint32_t k_val_6                  : 16; /**<bit[0 : 15] */
		uint32_t reserved_bit_16_31       : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} audio_reg_k_val_6_t;


typedef volatile union {
	struct {
		uint32_t k_val_7                  : 16; /**<bit[0 : 15] */
		uint32_t reserved_bit_16_31       : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} audio_reg_k_val_7_t;


typedef volatile union {
	struct {
		uint32_t st_val_0                 : 24; /**<bit[0 : 23] */
		uint32_t reserved_bit_24_31       :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} audio_reg_st_val_0_t;


typedef volatile union {
	struct {
		uint32_t st_val_1                 : 24; /**<bit[0 : 23] */
		uint32_t reserved_bit_24_31       :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} audio_reg_st_val_1_t;


typedef volatile union {
	struct {
		uint32_t st_val_2                 : 24; /**<bit[0 : 23] */
		uint32_t reserved_bit_24_31       :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} audio_reg_st_val_2_t;


typedef volatile union {
	struct {
		uint32_t st_val_3                 : 24; /**<bit[0 : 23] */
		uint32_t reserved_bit_24_31       :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} audio_reg_st_val_3_t;


typedef volatile union {
	struct {
		uint32_t st_val_4                 : 24; /**<bit[0 : 23] */
		uint32_t reserved_bit_24_31       :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} audio_reg_st_val_4_t;


typedef volatile union {
	struct {
		uint32_t st_val_5                 : 24; /**<bit[0 : 23] */
		uint32_t reserved_bit_24_31       :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} audio_reg_st_val_5_t;


typedef volatile union {
	struct {
		uint32_t st_val_6                 : 24; /**<bit[0 : 23] */
		uint32_t reserved_bit_24_31       :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} audio_reg_st_val_6_t;


typedef volatile union {
	struct {
		uint32_t st_val_7                 : 24; /**<bit[0 : 23] */
		uint32_t reserved_bit_24_31       :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} audio_reg_st_val_7_t;


typedef volatile union {
	struct {
		uint32_t p_val_0                  :  8; /**<bit[0 : 7] */
		uint32_t reserved_bit_8_31        : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} audio_reg_p_val_0_t;


typedef volatile union {
	struct {
		uint32_t p_val_1                  :  8; /**<bit[0 : 7] */
		uint32_t reserved_bit_8_31        : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} audio_reg_p_val_1_t;


typedef volatile union {
	struct {
		uint32_t p_val_2                  :  8; /**<bit[0 : 7] */
		uint32_t reserved_bit_8_31        : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} audio_reg_p_val_2_t;


typedef volatile union {
	struct {
		uint32_t p_val_3                  :  8; /**<bit[0 : 7] */
		uint32_t reserved_bit_8_31        : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} audio_reg_p_val_3_t;


typedef volatile union {
	struct {
		uint32_t p_val_4                  :  8; /**<bit[0 : 7] */
		uint32_t reserved_bit_8_31        : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} audio_reg_p_val_4_t;


typedef volatile union {
	struct {
		uint32_t p_val_5                  :  8; /**<bit[0 : 7] */
		uint32_t reserved_bit_8_31        : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} audio_reg_p_val_5_t;


typedef volatile union {
	struct {
		uint32_t p_val_6                  :  8; /**<bit[0 : 7] */
		uint32_t reserved_bit_8_31        : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} audio_reg_p_val_6_t;


typedef volatile union {
	struct {
		uint32_t anc_iir_bps0             : 10; /**<bit[0 : 9] */
		uint32_t anc_iir_bps1             : 10; /**<bit[10 : 19] */
		uint32_t anc_iir_bps2             : 10; /**<bit[20 : 29] */
		uint32_t reserved_bit_30_31       :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} audio_reg_anc_iir_bps_t;


typedef volatile union {
	struct {
		uint32_t adc_chn0_sel             :  3; /**<bit[0 : 2] */
		uint32_t reserved_bit_3_3         :  1; /**<bit[3 : 3] */
		uint32_t adc_chn1_sel             :  3; /**<bit[4 : 6] */
		uint32_t reserved_bit_7_7         :  1; /**<bit[7 : 7] */
		uint32_t adc_chn2_sel             :  3; /**<bit[8 : 10] */
		uint32_t reserved_bit_11_11       :  1; /**<bit[11 : 11] */
		uint32_t adc_chn3_sel             :  3; /**<bit[12 : 14] */
		uint32_t reserved_bit_15_15       :  1; /**<bit[15 : 15] */
		uint32_t adc_chn4_sel             :  3; /**<bit[16 : 18] */
		uint32_t reserved_bit_19_19       :  1; /**<bit[19 : 19] */
		uint32_t dac_r_chn_sel            :  1; /**<bit[20 : 20] */
		uint32_t dac_l_chn_sel            :  1; /**<bit[21 : 21] */
		uint32_t clk_frc_on               :  5; /**<bit[22 : 26] */
		uint32_t reserved_bit_27_31       :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} audio_reg_interface_matrix_t;

typedef volatile struct {
	volatile audio_reg_device_id_t device_id;
	volatile audio_reg_version_id_t version_id;
	volatile audio_reg_reserved0_t reserved0;
	volatile audio_reg_reserved1_t reserved1;
	volatile audio_reg_sys_cfg_t sys_cfg;
	volatile audio_reg_a2dp_comp_t a2dp_comp;
	volatile audio_reg_adc_cfg_t adc_cfg;
	volatile audio_reg_anc_cfg_t anc_cfg;
	volatile audio_reg_dac_cfg_t dac_cfg;
	volatile audio_reg_adc_cic_coef0_t adc_cic_coef0;
	volatile audio_reg_adc_cic_coef1_t adc_cic_coef1;
	volatile audio_reg_adc_cic_coef2_t adc_cic_coef2;
	volatile audio_reg_adc_cic_coef3_t adc_cic_coef3;
	volatile audio_reg_adc_cic_coef4_t adc_cic_coef4;
	volatile audio_reg_adc_cic_coef5_t adc_cic_coef5;
	volatile audio_reg_adc_cic_coef6_t adc_cic_coef6;
	volatile audio_reg_adc_cic_coef7_t adc_cic_coef7;
	volatile audio_reg_mic1_dbg_ctrl_t mic1_dbg_ctrl;
	volatile audio_reg_buf_ctrl_t buf_ctrl;
	volatile audio_reg_mic_fifo_cfg_t mic_fifo_cfg;
	volatile audio_reg_spk0_fifo_cfg_t spk0_fifo_cfg;
	volatile audio_reg_spk1_fifo_cfg_t spk1_fifo_cfg;
	volatile audio_reg_adc_cut_cfg_t adc_cut_cfg;
	volatile audio_reg_iir_sft_cfg_t iir_sft_cfg;
	volatile audio_reg_dac_cfg1_t dac_cfg1;
	volatile audio_reg_anc_cfg2_t anc_cfg2;
	volatile audio_reg_ramp_up_cfg_t ramp_up_cfg;
	volatile audio_reg_anc1_gain_cfg1_t anc1_gain_cfg1;
	volatile audio_reg_anc1_gain_cfg2_t anc1_gain_cfg2;
	volatile audio_reg_anc1_gain_cfg3_t anc1_gain_cfg3;
	volatile uint32_t rsv_1e_1e[1];
	volatile audio_reg_anc1_gain_cfg4_t anc1_gain_cfg4;
	volatile audio_reg_sync_ctrl1_t sync_ctrl1;
	volatile audio_reg_sync_ctrl2_t sync_ctrl2;
	volatile uint32_t rsv_22_23[2];
	volatile audio_reg_dac_ro_sts_t dac_ro_sts;
	volatile audio_reg_adc_ro_sts_t adc_ro_sts;
	volatile audio_reg_anc_sts_t anc_sts;
	volatile audio_reg_ramp_intr_ctrl_t ramp_intr_ctrl;
	volatile audio_reg_aud_int_ctrl_t aud_int_ctrl;
	volatile audio_reg_aud_int_sts_t aud_int_sts;
	volatile audio_reg_anc2_limit_cfg1_t anc2_limit_cfg1;
	volatile audio_reg_anc2_limit_cfg2_t anc2_limit_cfg2;
	volatile audio_reg_anc1_limit_cfg1_t anc1_limit_cfg1;
	volatile audio_reg_anc1_limit_cfg2_t anc1_limit_cfg2;
	volatile audio_reg_anc2_gain_cfg1_t anc2_gain_cfg1;
	volatile audio_reg_anc2_gain_cfg2_t anc2_gain_cfg2;
	volatile audio_reg_anc2_gain_cfg3_t anc2_gain_cfg3;
	volatile audio_reg_anc2_gain_cfg4_t anc2_gain_cfg4;
	volatile audio_reg_anc_comp_cfg_t anc_comp_cfg;
	volatile audio_reg_dac_gain_cfg0_t dac_gain_cfg0;
	volatile audio_reg_dac_gain_cfg1_t dac_gain_cfg1;
	volatile audio_reg_dac_gain_cfg2_t dac_gain_cfg2;
	volatile audio_reg_dac_gain_cfg3_t dac_gain_cfg3;
	volatile audio_reg_dac_gain_cfg4_t dac_gain_cfg4;
	volatile audio_reg_dac_gain_cfg5_t dac_gain_cfg5;
	volatile audio_reg_adc_gain_cfg1_t adc_gain_cfg1;
	volatile audio_reg_dac_l_gain_mix_t dac_l_gain_mix;
	volatile audio_reg_dac_r_gain_mix_t dac_r_gain_mix;
	volatile uint32_t rsv_3c_3f[4];
	volatile audio_reg_adc_gain_cfg2_t adc_gain_cfg2;
	volatile audio_reg_adc_gain_cfg3_t adc_gain_cfg3;
	volatile audio_reg_adc_gain_cfg4_t adc_gain_cfg4;
	volatile audio_reg_adc_gain_cfg5_t adc_gain_cfg5;
	volatile audio_reg_anc_sft_l_para_t anc_sft_l_para;
	volatile audio_reg_anc_sft_r_para_t anc_sft_r_para;
	volatile audio_reg_k_val_0_t k_val_0;
	volatile audio_reg_k_val_1_t k_val_1;
	volatile audio_reg_k_val_2_t k_val_2;
	volatile audio_reg_k_val_3_t k_val_3;
	volatile audio_reg_k_val_4_t k_val_4;
	volatile audio_reg_k_val_5_t k_val_5;
	volatile audio_reg_k_val_6_t k_val_6;
	volatile audio_reg_k_val_7_t k_val_7;
	volatile audio_reg_st_val_0_t st_val_0;
	volatile audio_reg_st_val_1_t st_val_1;
	volatile audio_reg_st_val_2_t st_val_2;
	volatile audio_reg_st_val_3_t st_val_3;
	volatile audio_reg_st_val_4_t st_val_4;
	volatile audio_reg_st_val_5_t st_val_5;
	volatile audio_reg_st_val_6_t st_val_6;
	volatile audio_reg_st_val_7_t st_val_7;
	volatile audio_reg_p_val_0_t p_val_0;
	volatile audio_reg_p_val_1_t p_val_1;
	volatile audio_reg_p_val_2_t p_val_2;
	volatile audio_reg_p_val_3_t p_val_3;
	volatile audio_reg_p_val_4_t p_val_4;
	volatile audio_reg_p_val_5_t p_val_5;
	volatile audio_reg_p_val_6_t p_val_6;
	volatile audio_reg_anc_iir_bps_t anc_iir_bps;
	volatile audio_reg_interface_matrix_t interface_matrix;
} audio_reg_hw_t;

#ifdef __cplusplus
}
#endif
